docs: update diagram and changelog
